АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/алк_ПересортицаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПересортицаНоменклатуры</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      <types>DocumentRef.алк_ВозвратОтветхранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэфПересортицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>EnumRef.алк_ВидыРегистровИнвентаризации</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыРасход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыПриход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииНаОтветхранении/алк_УчетЛесопродукцииНаОтветхранении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииНаОтветхранении</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияТД</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/ЛинияПиленияКоэффициентЧураки/ЛинияПиленияКоэффициентЧураки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛинияПиленияКоэффициентЧураки</name>
  <comment>Удалить Кэффициент при учете объемов отходов лесопиления (чураки)</comment>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоменклатураОтход</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ШтабельОтход</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </resources>
  <dimensions>
    <name>Диаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлинаБревна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыОрганизации/алк_ЗапасыОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыНов</name>
    <comment>Для перемещения из измерения в реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Catalogs/СертификатыНаПродукцию/СертификатыНаПродукцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыНаПродукцию</name>
  <attributes>
    <name>НомерСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаПечать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
		Объект.СтруктурнаяЕдиница    = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);
		
	КонецЕсли;  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ЗапасыРасходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыРасход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыРасходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыРасход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыПриход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыПриход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиКомманд

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	ЗаполнитьПоДокументуОснованию();
	
КонецПроцедуры


#КонецОбласти 


#Область СлужебныеПиФ

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснованию()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Документ будет полностью перезаполнен по ""Основанию"".
	|Продолжить выполнение операции?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОпределитьНеобходимостьЗаполненияДокументаПоОснованию", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
конецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаСервере
Процедура ЗаполнитьПоДокументу()
	
	
	// Нач мод [Пакушев И.С.] [05.03.2019] 
	// Обращение № [0000000000] [ТекстЗаявки]
	// Было
	// Стало
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.алк_ВозвратОтветхранения") Тогда
		
		Документ = РеквизитФормыВЗначение("Объект");
		//Документ.Заполнить(Новый Структура("ЗаполнитьПоДокументамОснованиям", Истина));
		
		
		Если Ложь Тогда
			Документ = документы.алк_ПересортицаНоменклатуры.НайтиПоНомеру("");	
		КонецЕсли; 
		
		Документ.ЗапасыРасход.Очистить();  // уменьшаемое - будел заполнять имеющимися остатками
		
		МассивХарактеристики = Документ.ДокументОснование.Запасы.ВыгрузитьКолонку("Характеристика");
		
		ТЗ = Документ.ДокументОснование.Запасы.Выгрузить();
		
		Для каждого Стр Из ТЗ Цикл   		
			                         		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Партия,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Организация,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК Количество,
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК Объем
			|ИЗ
			|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(&ДатаОстатки, ) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
			|ГДЕ
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика = &Характеристика
			|	И алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель = &Штабель
			|	И алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура = &Номенклатура
			|	И алк_УчетЛесопродукцииНаОтветхраненииОстатки.Организация = &Организация
			|	И алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|	И алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат <> &СертификатПустой
			|
			|УПОРЯДОЧИТЬ ПО
			|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат.Наименование";
			
			Запрос.УстановитьПараметр("ДатаОстатки", Новый МоментВремени(Документ.ДокументОснование.Дата, Документ.ДокументОснование)); 
			Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
			Запрос.УстановитьПараметр("Организация", Документ.ДокументОснование.Организация);
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Документ.ДокументОснование.СтруктурнаяЕдиница);
			Запрос.УстановитьПараметр("Характеристика",Стр. Характеристика);
			Запрос.УстановитьПараметр("Штабель", Стр.Штабель);
			Запрос.УстановитьПараметр("СертификатПустой", Справочники.СертификатыНаПродукцию.ПустаяСсылка());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если Стр.Объем <= 0 Или Стр.Количество <= 0 Тогда
					Прервать;			
				КонецЕсли; 
				
				НоваяСтрРасход = Документ.ЗапасыРасход.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрРасход, ВыборкаДетальныеЗаписи);
				
				Объем = Мин(Стр.Объем, ВыборкаДетальныеЗаписи.Объем);
				Количество = Мин(Стр.Количество, ВыборкаДетальныеЗаписи.Количество);			
				
				НоваяСтрРасход.Объем = Объем;
				НоваяСтрРасход.Количество = Количество;
				
				Стр.Объем = Стр.Объем - Объем;
				Стр.Количество = Стр.Количество - Количество; 				
				
			КонецЦикла;
		КонецЦикла;

				
		Документ.ЗапасыПриход.Очистить(); // увеличиваемое - заполняем тем, что списывает документ "Возврат на ответ хранение"
		
		Для каждого СтрЗапасы Из Документ.ДокументОснование.Запасы Цикл         			
			СтрПриходНовая = Документ.ЗапасыПриход.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрПриходНовая, СтрЗапасы);
			СтрПриходНовая.Сертификат = Документ.ДокументОснование.Сертификат;				
		КонецЦикла;  	
		
		ЗначениеВРеквизитФормы(Документ, "Объект");
		Модифицированность = Истина;
			
	Иначе 
	// Кон мод [Пакушев И.С.] [05.03.2019]  
		           		
		Документ = РеквизитФормыВЗначение("Объект");
		Документ.Заполнить(Новый Структура("ЗаполнитьПоДокументамОснованиям", Истина));
		ЗначениеВРеквизитФормы(Документ, "Объект");
		Модифицированность = Истина;
		//УстановитьВидимостьРеквизитов();
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоДокументу()

#КонецОбласти 


#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОпределитьНеобходимостьЗаполненияДокументаПоОснованию(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоДокументу();
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьНеобходимостьЗаполненияДокументаПоОснованию()


#КонецОбласти


&НаСервере
Процедура ЗаполнитьОтходыНаСервере()

	Объект.ЗапасыПриход.Очистить();
	
	Для каждого стр из Объект.ЗапасыРасход Цикл
		ПараметрыХарактеристик = РегистрыСведений.алк_ПараметрыХарактеристик.Получить(Новый Структура("Характеристика",стр.Характеристика));
		Коэффициенты = РегистрыСведений.ЛинияПиленияКоэффициентЧураки.Получить(Новый Структура("Диаметр,ДлинаБревна",ПараметрыХарактеристик.Сечение.ДиаметрММ/10,ПараметрыХарактеристик.Длина.ДлинаММ/1000));
		новстр = Объект.ЗапасыПриход.Добавить();
		новстр.Штабель = Коэффициенты.ШтабельОтход;
		новстр.Номенклатура = Коэффициенты.НоменклатураОтход;
		новстр.Объем = стр.Объем * Коэффициенты.Коэффициент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтходы(Команда)
	ЗаполнитьОтходыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	а = 1;
КонецПроцедуры



// Нач мод [Пакушев И.С.] [20.02.2019] 
// Обращение № [0000000000] [ТекстЗаявки]
// Было
// Стало

&НаКлиенте
Процедура СечениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда 		
		Сообщить("Заполните номенклатуру!"); 		
		Возврат;	                                  	
	КонецЕсли;
	
	СписокДляВыбора = СписокСечениеНачалоВыбораНаСервере(Сечение, Объект.КатегорияНоменклатуры);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовСечение", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Сорта и влажность.");
	
КонецПроцедуры

&НаСервере
Функция СписокСечениеНачалоВыбораНаСервере(СтрСечение, КатегорияНоменклатуры)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	МассивСеченией 	= ПолучитьМассивСечений(СтрСечение, КатегорияНоменклатуры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмерСечения.Наименование,
	|	РазмерСечения.Ссылка
	|ИЗ
	|	Справочник.РазмерСечения КАК РазмерСечения
	|ГДЕ
	|	РазмерСечения.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмерСечения.ДиаметрММ";
	
	Запрос.УстановитьПараметр("Владелец", КатегорияНоменклатуры);
		
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивСеченией.Найти(ВыборкаДетальныеЗаписи.Ссылка) = Неопределено Тогда
			Отметка = Ложь;
		Иначе
			Отметка = Истина;
		КонецЕсли;
		
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,Отметка);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции 

&НаКлиенте
Процедура ПослеОтметкиЭлементовСечение(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора <> Неопределено Тогда
		
		СписокСечение = "";
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокСечение = СписокСечение + Элемент.Значение + "; ";
			КонецЕсли;
		КонецЦикла;
		
		Сечение = СписокСечение;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСечений(СтрСечение, КатегорияНоменклатуры)

	//СтрСечение 	= СтрЗаменить(СтрСечение, " ", "");
	
	МассивСтрок = РазложитьСтрокуВМассив(СтрСечение, "; "); 
	
	МассивСечений 		= Новый Массив;
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазмерСечения.Ссылка
		|ИЗ
		|	Справочник.РазмерСечения КАК РазмерСечения
		|ГДЕ
		|	НЕ РазмерСечения.ПометкаУдаления
		|	И РазмерСечения.Владелец = &Владелец
		|	И РазмерСечения.Наименование В(&Наименование)
		|	И РазмерСечения.Наименование <> """"";
	
	Запрос.УстановитьПараметр("Владелец", 		КатегорияНоменклатуры);  
	Запрос.УстановитьПараметр("Наименование", 	МассивСтрок);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСечений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Возврат МассивСечений;
	
КонецФункции // ПолучитьМассивСечений()

&НаСервереБезКонтекста
// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - строка, которую необходимо разложить на подстроки. 
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//       
Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции    

&НаСервере
Процедура ЗаполнитьОстаткиОтветХраненияНаСервере(МассивСечение)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ДатаСмены КАК ДатаСмены,
		|	ВложенныйЗапрос.Смена,
		|	ВложенныйЗапрос.ПартияТД,
		|	ВложенныйЗапрос.СтруктурнаяЕдиница,
		|	ВложенныйЗапрос.Штабель,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Партия,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.УдалитьСертификатFSC,
		|	ВложенныйЗапрос.Сертификат,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Объем,
		|	ВложенныйЗапрос.Сечение,
		|	ВложенныйЗапрос.Порода,
		|	ВложенныйЗапрос.Длина,
		|	ВложенныйЗапрос.Сорт
		|ИЗ
		|	(ВЫБРАТЬ
		|		&Период КАК Период,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ДатаСмены КАК ДатаСмены,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Смена КАК Смена,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ПартияТД КАК ПартияТД,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Штабель,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура КАК Номенклатура,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика КАК Характеристика,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Партия КАК Партия,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Организация КАК Организация,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.УдалитьСертификатFSC КАК УдалитьСертификатFSC,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат КАК Сертификат,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК Количество,
		|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК Объем,
		|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|		алк_ПараметрыХарактеристик.Порода КАК Порода,
		|		алк_ПараметрыХарактеристик.Длина КАК Длина,
		|		алк_ПараметрыХарактеристик.Сорт КАК Сорт
		|	ИЗ
		|		РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
		|				&Период,
		|				Штабель = &Штабель
		|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика) КАК ВложенныйЗапрос
		|ГДЕ
		|	(НЕ ВложенныйЗапрос.Сечение В (&Сечение)
		|			ИЛИ &ЛюбоеСечение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСмены УБЫВ";
	
	Запрос.УстановитьПараметр("Период", 			Объект.Дата);
	Запрос.УстановитьПараметр("Сечение", 			МассивСечение);
	Запрос.УстановитьПараметр("ЛюбоеСечение", 		?(МассивСечение.Количество() = 0, Истина, Ложь));
	Запрос.УстановитьПараметр("Штабель", 			Штабель);   
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить(); //.Выбрать();
	
	ТЗ_1 = ТЗ.Скопировать();
	
	ТЗ_1.Свернуть("Штабель, Длина, Порода, Сорт, Сечение","Объем, Количество");
	
	Для каждого Стр Из ТЗ_1 Цикл
		
		Если ВывестиВНоль Тогда 			
			Продолжить;	
		КонецЕсли; 
		
		Отбор = Новый Структура("Штабель, Длина, Порода, Сорт, Сечение", Стр.Штабель, Стр.Длина, Стр.Порода, Стр.Сорт, Стр.Сечение);
		
		НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
		
		ТЗ_2 = ТЗ.Скопировать(НайденныеСтроки);
		
		ТЗ_2.Свернуть("Штабель, Длина, Порода, Сорт, Сечение, Партия","Объем, Количество");
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Отбор_2 = Новый Структура("Партия, Штабель, Длина, Порода, Сорт, Сечение", НайденнаяСтрока.Партия,Стр.Штабель, Стр.Длина, Стр.Порода, Стр.Сорт, Стр.Сечение);
			
			НайденныеСтроки_2 = ТЗ_2.НайтиСтроки(Отбор_2);
			
			//Если НайденныеСтроки_2.Количество()>0 Тогда
			//	Продолжить;		
			//КонецЕсли; 
			
			Если НайденнаяСтрока.Объем <=0 Или НайденнаяСтрока.Количество <=0  Тогда
				Продолжить;		
			КонецЕсли; 
			
			// есть строки +/- по партиям, тогда нужно эту патрию пропустить
			
			//Для каждого Стр_1 Из НайденныеСтроки Цикл
			//
			//	
			//
			//КонецЦикла;
			
			Объем 		= Мин(НайденнаяСтрока.Объем, Стр.Объем);
			Количество 	= Мин(НайденнаяСтрока.Количество, Стр.Количество);
			
			НайденныеСтроки_2[0].Объем = НайденныеСтроки_2[0].Объем - Объем;
			
			Если НайденныеСтроки_2[0].Объем < 0 Тогда
				Продолжить;			
			КонецЕсли;
			
			
			НайденнаяСтрока.Объем = НайденнаяСтрока.Объем - Объем;
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Количество; 	
			
			Стр.Объем = Стр.Объем - Объем;
			Стр.Количество = Стр.Количество - Количество; 
		КонецЦикла; 
	КонецЦикла; 
	
	Объект.ЗапасыПриход.Очистить();
	Объект.ЗапасыРасход.Очистить();	
	
	Для каждого Стр Из ТЗ Цикл
		
		Если Стр.Объем = 0 И Стр.Количество = 0  Тогда
			Продолжить;		
		КонецЕсли;
		
		Если Стр.Объем <=0 И Стр.Количество <=0 Тогда
			
			НоваяСтр = Объект.ЗапасыПриход.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
			НоваяСтр.Количество	= -Стр.Количество;
			НоваяСтр.Объем 		= -Стр.Объем;
			
		ИначеЕсли Стр.Объем >=0 И Стр.Количество >=0 Тогда

			НоваяСтр = Объект.ЗапасыРасход.Добавить();		
			ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
			
		Иначе
			
			Сообщить("Плюс и минус в одной строке!");		
			
		КонецЕсли; 
		
		
		
	КонецЦикла; 
	
	
	
	//Объект.Запасы.Очистить();
	//
	//Объект.Запасы.Загрузить(ТЗ);

	//Модифицированность = Истина;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиОтветХранения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда  		
		Сообщить("Заполните номенклатуру!");		
		Возврат;	                      	
	КонецЕсли;
	
	МассивСеченией 	= ПолучитьМассивСечений(Сечение, Объект.КатегорияНоменклатуры);
	
	ЗаполнитьОстаткиОтветХраненияНаСервере(МассивСеченией);
	
КонецПроцедуры

&НаСервере
Процедура ПереводВКонтролируемыйНаСервере(МассивСеченией)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Период,
	//	|	ВложенныйЗапрос.ДатаСмены КАК ДатаСмены,
	//	|	ВложенныйЗапрос.Смена,
	//	|	ВложенныйЗапрос.ПартияТД,
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//	|	ВложенныйЗапрос.Штабель,
	//	|	ВложенныйЗапрос.Номенклатура,
	//	|	ВложенныйЗапрос.Характеристика,
	//	|	ВложенныйЗапрос.Партия,
	//	|	ВложенныйЗапрос.Организация,
	//	|	ВложенныйЗапрос.УдалитьСертификатFSC,
	//	|	ВложенныйЗапрос.Сертификат,
	//	|	ВложенныйЗапрос.Количество,
	//	|	ВложенныйЗапрос.Объем,
	//	|	ВложенныйЗапрос.Сечение,
	//	|	ВложенныйЗапрос.Порода,
	//	|	ВложенныйЗапрос.Длина,
	//	|	ВложенныйЗапрос.Сорт
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		&Период КАК Период,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ДатаСмены КАК ДатаСмены,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Смена КАК Смена,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ПартияТД КАК ПартияТД,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Штабель,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура КАК Номенклатура,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика КАК Характеристика,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Партия КАК Партия,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Организация КАК Организация,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.УдалитьСертификатFSC КАК УдалитьСертификатFSC,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат КАК Сертификат,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК Количество,
	//	|		алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК Объем,
	//	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	//	|		алк_ПараметрыХарактеристик.Порода КАК Порода,
	//	|		алк_ПараметрыХарактеристик.Длина КАК Длина,
	//	|		алк_ПараметрыХарактеристик.Сорт КАК Сорт
	//	|	ИЗ
	//	|		РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
	//	|				&Период,
	//	|				Штабель = &Штабель
	//	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//	|			ПО алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика) КАК ВложенныйЗапрос
	//	|ГДЕ
	//	|	(НЕ ВложенныйЗапрос.Сечение В (&Сечение)
	//	|			ИЛИ &ЛюбоеСечение)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДатаСмены УБЫВ";
	//
	//Запрос.УстановитьПараметр("Период", 			Объект.Дата);
	//Запрос.УстановитьПараметр("Сечение", 			МассивСечение);
	//Запрос.УстановитьПараметр("ЛюбоеСечение", 		?(МассивСечение.Количество() = 0, Истина, Ложь));
	//Запрос.УстановитьПараметр("Штабель", 			Штабель);   
	//Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ТЗ = РезультатЗапроса.Выгрузить(); //.Выбрать();
	
	//ТЗ_1 = ТЗ.Скопировать();
	//
	//ТЗ_1.Свернуть("Штабель, Длина, Порода, Сорт, Сечение","Объем, Количество");
	//
	//Для каждого Стр Из ТЗ_1 Цикл
	//	
	//	Если ВывестиВНоль Тогда 			
	//		Продолжить;	
	//	КонецЕсли; 
	//	
	//	Отбор = Новый Структура("Штабель, Длина, Порода, Сорт, Сечение", Стр.Штабель, Стр.Длина, Стр.Порода, Стр.Сорт, Стр.Сечение);
	//	
	//	НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
	//	
	//	ТЗ_2 = ТЗ.Скопировать(НайденныеСтроки);
	//	
	//	ТЗ_2.Свернуть("Штабель, Длина, Порода, Сорт, Сечение, Партия","Объем, Количество");
	//	
	//	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//		
	//		Отбор_2 = Новый Структура("Партия, Штабель, Длина, Порода, Сорт, Сечение", НайденнаяСтрока.Партия,Стр.Штабель, Стр.Длина, Стр.Порода, Стр.Сорт, Стр.Сечение);
	//		
	//		НайденныеСтроки_2 = ТЗ_2.НайтиСтроки(Отбор_2);
	//		
	//		//Если НайденныеСтроки_2.Количество()>0 Тогда
	//		//	Продолжить;		
	//		//КонецЕсли; 
	//		
	//		Если НайденнаяСтрока.Объем <=0 Или НайденнаяСтрока.Количество <=0  Тогда
	//			Продолжить;		
	//		КонецЕсли; 
	//		
	//		// есть строки +/- по партиям, тогда нужно эту патрию пропустить
	//		
	//		//Для каждого Стр_1 Из НайденныеСтроки Цикл
	//		//
	//		//	
	//		//
	//		//КонецЦикла;
	//		
	//		Объем 		= Мин(НайденнаяСтрока.Объем, Стр.Объем);
	//		Количество 	= Мин(НайденнаяСтрока.Количество, Стр.Количество);
	//		
	//		НайденныеСтроки_2[0].Объем = НайденныеСтроки_2[0].Объем - Объем;
	//		
	//		Если НайденныеСтроки_2[0].Объем < 0 Тогда
	//			Продолжить;			
	//		КонецЕсли;
	//		
	//		
	//		НайденнаяСтрока.Объем = НайденнаяСтрока.Объем - Объем;
	//		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Количество; 	
	//		
	//		Стр.Объем = Стр.Объем - Объем;
	//		Стр.Количество = Стр.Количество - Количество; 
	//	КонецЦикла; 
	//КонецЦикла; 
	//
	//Объект.ЗапасыПриход.Очистить();
	//Объект.ЗапасыРасход.Очистить();	
	//
	//Для каждого Стр Из ТЗ Цикл
	//	
	//	Если Стр.Объем = 0 И Стр.Количество = 0  Тогда
	//		Продолжить;		
	//	КонецЕсли;
	//	
	//	Если Стр.Объем <=0 И Стр.Количество <=0 Тогда
	//		
	//		НоваяСтр = Объект.ЗапасыПриход.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
	//		НоваяСтр.Количество	= -Стр.Количество;
	//		НоваяСтр.Объем 		= -Стр.Объем;
	//		
	//	ИначеЕсли Стр.Объем >=0 И Стр.Количество >=0 Тогда

	//		НоваяСтр = Объект.ЗапасыРасход.Добавить();		
	//		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
	//		
	//	Иначе
	//		
	//		Сообщить("Плюс и минус в одной строке!");		
	//		
	//	КонецЕсли; 
	//	
	//	
	//	
	//КонецЦикла; 
	
	

КонецПроцедуры

// Кон мод [Пакушев И.С.] [20.02.2019]


&НаКлиенте
Процедура ПереводВКонтролируемый(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда  		
		Сообщить("Заполните номенклатуру!");		
		Возврат;	                      	
	КонецЕсли;
	
	МассивСеченией 	= ПолучитьМассивСечений(Сечение, Объект.КатегорияНоменклатуры);
	
	ПереводВКонтролируемыйНаСервере(МассивСеченией);

	
КонецПроцедуры

&НаСервере
Процедура ПереводОстатковНаТДНаСервере()
	
	ПартнерТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");  // ТД
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Штабель,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура КАК Номенклатура,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика КАК Характеристика,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат КАК Сертификат,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Партия,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ПартияТД,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Контрагент КАК Контрагент,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК Количество,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК Объем
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
		|			&ДатаОстатков,
		|			Контрагент.Партнер = &ПартнерТД
		|				И НЕ Контрагент = &ПартнерТД) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Сертификат,
		|	Штабель,
		|	Номенклатура,
		|	Характеристика";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Объект.Дата);
	Запрос.УстановитьПараметр("ПартнерТД", ПартнерТД);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Объект.ЗапасыПриход.Очистить();
	Объект.ЗапасыРасход.Очистить();
	
	Объект.ЗапасыПриход.Загрузить(ТЗ);
	Объект.ЗапасыРасход.Загрузить(ТЗ);
	
	Для каждого Стр Из Объект.ЗапасыПриход Цикл
		Стр.Контрагент = ПартнерТД;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводОстатковНаТД(Команда)
	ПереводОстатковНаТДНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправлениеСертификатовНаСервере()
	
	СертификатТД_100	= Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000007"); // 100% PEFC certified RU18/818418726
	СертификатТД_Контр	= Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000013"); // PEFC controlled sources RU18/818418726
	
	
	ПартнерТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");  // ТД
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Штабель,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура КАК Номенклатура,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика КАК Характеристика,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат КАК Сертификат,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Партия,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ПартияТД,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Контрагент КАК Контрагент,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК Количество,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК Объем
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
		|			&ДатаОстатков,
		|			Контрагент = &ПартнерТД
		|				И НЕ Сертификат = &СертификатТД_100
		|				И НЕ Сертификат = &СертификатТД_Контр) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Сертификат,
		|	Штабель,
		|	Номенклатура,
		|	Характеристика";
	
	Запрос.УстановитьПараметр("ДатаОстатков", 		Объект.Дата);
	Запрос.УстановитьПараметр("СертификатТД_100", 	СертификатТД_100);
	Запрос.УстановитьПараметр("СертификатТД_Контр", СертификатТД_Контр);
	Запрос.УстановитьПараметр("ПартнерТД", 			ПартнерТД);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Объект.ЗапасыПриход.Очистить();
	Объект.ЗапасыРасход.Очистить();
	
	Объект.ЗапасыПриход.Загрузить(ТЗ);
	Объект.ЗапасыРасход.Загрузить(ТЗ);
	
	Для каждого Стр Из Объект.ЗапасыПриход Цикл
		Стр.Сертификат = СертификатТД_Контр;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ИсправлениеСертификатовНаСервере1() 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
		|	алк_ЗапасыОрганизацииОстатки.Характеристика,
		|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток КАК Количество,
		|	алк_ЗапасыОрганизацииОстатки.ОбъемОстаток КАК Объем,
		|	алк_ЗапасыОрганизацииОстатки.Ячейка КАК Штабель,
		|	алк_ЗапасыОрганизацииОстатки.Сертификат
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(
		|			&ДатаСреза,
		|			Номенклатура.КатегорияНоменклатуры = &Категория
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_ЗапасыОрганизацииОстатки";
	
	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	Запрос.УстановитьПараметр("Категория", Объект.КатегорияНоменклатуры);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
		
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.ЗапасыПриход.Очистить();
	Объект.ЗапасыРасход.Очистить();
	
	Объект.ЗапасыРасход.Загрузить(ТЗ); 
	
    ТЗ.Колонки.Удалить(5);
	
	Объект.ЗапасыПриход.Загрузить(ТЗ);
	
КонецПроцедуры



&НаКлиенте
Процедура ИсправлениеСертификатов(Команда)
	ИсправлениеСертификатовНаСервере1();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
